app/controllers/tasks_controller.rb

SELECT "tasks".* FROM "tasks" WHERE "tasks"."variant" = 1 LIMIT 1
---
  def get_v
    @task = Task.find_by(variant: 1)

SELECT "tasks".* FROM "tasks" WHERE "tasks"."variant" = 1 LIMIT 1
---
  def get_g
    @task = Task.find_by(variant: 1)